# -*- coding: utf-8 -*-
# Этот токен для бота OlegsBank_Bot
token = '279913823:AAHlA3eHc52hKrddnopvqBLsBSwGiSp0UMg'



VALBOT = { '/start': 'Приветствую тебя!  *Я бот OlegsBank*, могу ответить на твои вопросы и научить тебя как управляться с баблом',
        'Привет':'Привет, *мой хозяин!*',
        'Привет!':"Привет, *мой повелитель!*",
        'Как дела?':'Да нормально, в общем',
        'Давно не спишь?':'Уже три дня',
        'А почему?':'Команды не поступало...',
        'Спи давай':'Слушаюсь!',
        'Сделай кофе':'Кому кофе? Тебе или мне?',
        'Сделай мне кофе':'Уже бегу',
        'Денег хочешь?':'Я Олег бот, я всегда хочу денег',
        'Ты откуда?':'Из Москвы',
        'Ты хам':'Нет, я - *Олег БОТ*',
        'А почему хамишь?':'Ты ведь меня создал, вот и ответь сам',
        'Что делаешь?':'Снабжаю тебя умными знаниями о бабле',
        'Кто тебя создал?':"О, это Великий Создатель!",
        'Как зовут твою дочь?': 'У меня нет дочери, ведь я *БОТ*. А вот твою дочь зовут _Диана_ )',
        
        'Доллар':'Курс Доллара США: на бирже 64.00 руб, Курс ЦБ 65.00 руб. График смотри здесь: http://www.banki.ru/products/currency/usd/',
        'Евро':'Курс Евро: на бирже 74.00 руб, Курс ЦБ 75.00 руб Полюбуйся здесь: http://www.banki.ru/products/currency/eur/',
        'Обменники':'Три ближайших к тебе обменных пункта',
        'Фунт':'Курс Фунта стерлингов: на бирже 100.00 руб, Курс ЦБ 99.00 руб . Смотри картинку%: http://www.banki.ru/products/currency/gbp/',
        
        'Жене сапоги':'Хорошее дело. Но я советую не брать кредит  на это, а заработать самому. Иди паши!',
        'Хочу кредит':'А зачем тебе кредит? Может лучше карточку возьмешь... Она удобнее',
        'Хату':'Квартирку захотел? Ну-ну.. А ты заешь что по ипотеке ты переплатишь банку в 2 раза. Сейчас выгоднее снимать жилье, а деньги копить. Давай депозитик посмотрим?',
        'Нужна карта':'Отлично! Вот почитай и выбери себе',
        
        'Да':'Отлично. Тогда я сейчас научу тебя как этим пользоваться выгоднее',
        'Нет':'Ну я так и знал, чувак. Поэтому я и хочу предложить тебе другое',
        
        'Хочу стать миллионером':'Крутая цель. Давай учиться этому http://www.banki.ru/wikibank/s_chego_nachat_investirovanie_na_ryinke_tsennyih_bumag/',
        'Хочу копить':'Предлагаю на выбор узнть про депозиты, ПИФы или акции. Почитай сперва это - http://www.banki.ru/wikibank/s_chego_nachat_investirovanie_na_ryinke_tsennyih_bumag/',
        'Хочу тратить':'На что хочешь потратить?',
        
        'Покупаем?':'Естественно!',
        'Продаем?':'Ну сам решай',
        
        'Вклад':'Ну далеко ходить. Положи к нам на депозит и расслабься. У нас неплохие проценты по вкладам. Вот тут надо формочку заполнить. https://www.tinkoff.ru/deposit/ ',
        'Акции':'А ты с ними уже имел дело?  Я вобще-то не спекулянт. Но если очень нужен брокерский счет, то вот ребята делают. https://bcs.ru/become_customer',
        'ПИФы':'Обычно, если просто надо деньги пристроить и не париться, лучше взять ПИФ или ДУ. Доверительное управление то есть. Это значит умный дядя будет, не отвлекая тебя, находить куда вложить и заботиться о высоком доходе. Все богатые ребята так делают. Вот выбирай.  http://www.nlu.ru/renking-uk-doxod.htm',
        'Облигации':'Без риска можно брать облигации и ПИФы. Тут вот посмотри. Если ни хрена не понятно, просто тыкни на верхнюю строчку в рейтинге. http://pif.investfunds.ru/funds/rate.phtml',

        'Кредитная':'Подумай еще раз. Кредитная карта будет тебе стоить дороже. Почитай здесь http://www.banki.ru/wikibank/kreditnyie_kartyi/',
        'Дебетовая':'Отличный выбор. Если хочешь узнать больше, то вот тебе: http://www.banki.ru/products/debitcards/',
        'В рублях':'Молодец. Если живешь в России, то надо и карточку в рублях иметь   https://dl.dropboxusercontent.com/u/64262910/oleggbank/everything_ok.jpg',
        'В валюте':'За границу, видать, захотел?  Ну давай, вали разбазаривать народное достояние.  https://dl.dropboxusercontent.com/u/64262910/oleggbank/go_there.jpg'

        }
